arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>CFDCFCC%s</name>
                    <description>Common FIFO Configuration/Control Registers %s</description>
                    <addressOffset>0x0120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFE</name>
                            <description>Common FIFO Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>FIFO disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>FIFO enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFRXIE</name>
                            <description>Common FIFO RX Interrupt Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>FIFO interrupt generation disabled for Frame RX</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>FIFO interrupt generation enabled for Frame RX</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFTXIE</name>
                            <description>Common FIFO TX Interrupt Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>FIFO interrupt generation disabled for Frame TX</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>FIFO interrupt generation enabled for Frame TX</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFPLS</name>
                            <description>Common FIFO Payload Data Size Configuration</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>8 bytes</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>12 bytes</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>16 bytes</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>20 bytes</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>24 bytes</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>32 bytes</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>48 bytes</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>64 bytes</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFM</name>
                            <description>Common FIFO Mode</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>RX FIFO mode</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>TX FIFO mode</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>CAN – CAN GW FIFO mode</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Reserved</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFITSS</name>
                            <description>Common FIFO Interval Timer Source Select</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Reference clock (× 1 / × 10 period)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bit time clock of related channel (FIFO is linked to fixed channel)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFITR</name>
                            <description>Common FIFO Interval Timer Resolution</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Reference clock period × 1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reference clock period × 10</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFIM</name>
                            <description>Common FIFO Interrupt Mode</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RX FIFO mode: RX interrupt generated when Common FIFO counter reaches CFIGCV value from a lower value TX FIFO mode: TX interrupt generated when Common FIFO transmits the last message successfully GW FIFO mode: For RX interrupt flag: Interrupt generated when FIFO counter increments and reaches the value configured in CFIGCV For TX interrupt flag: Interrupt generated when FIFO transmits the last message successfully </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RX FIFO mode: RX interrupt generated at the end of every received message storage TX FIFO mode: interrupt generated for every successfully transmitted message GW FIFO mode: For RX interrupt flag: Interrupt generated when a message is stored in the FIFO For TX interrupt flag: Interrupt generated when a message is successfully transmitted from the FIFO </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFIGCV</name>
                            <description>Common FIFO Interrupt Generation Counter Value</description>
                            <lsb>13</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>Interrupt generated when FIFO is 1/8th full</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>Interrupt generated when FIFO is 1/4th full</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>Interrupt generated when FIFO is 3/8th full</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>Interrupt generated when FIFO is 1/2 full</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>Interrupt generated when FIFO is 5/8th full</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>Interrupt generated when FIFO is 3/4th full</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>Interrupt generated when FIFO is 7/8th full</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>Interrupt generated when FIFO is full</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFTML</name>
                            <description>Common FIFO TX Message Buffer Link</description>
                            <lsb>16</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDC</name>
                            <description>Common FIFO Depth Configuration</description>
                            <lsb>21</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>FIFO Depth = 0 messages</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>FIFO Depth = 4 messages</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>FIFO Depth = 8 messages</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>FIFO Depth = 16 messages</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>FIFO Depth = 32 messages</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>FIFO Depth = 48 messages</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>FIFO Depth = 64 messages</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>FIFO Depth = 128 messages</description>
                                    <value>#111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFITT</name>
                            <description>Common FIFO Interval Transmission Time</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
