arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDC%sBLCT</name>
                    <description>Channel %s Bus Load Control Register</description>
                    <addressOffset>0x1418</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BLCE</name>
                            <description>Bus Load Counter Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus load counter disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus load counter enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BLCLD</name>
                            <description>BUS Load Counter Load</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDC%sBLSTS</name>
                    <description>Channel %s Bus Load Status Register</description>
                    <addressOffset>0x141C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BLC</name>
                            <description>Bus Load Counter</description>
                            <lsb>3</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>1-16</dimIndex>
                    <name>CFDGAFLID%s</name>
                    <description>Global Acceptance Filter List ID Registers</description>
                    <addressOffset>0x1800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAFLID</name>
                            <description>Global Acceptance Filter List Entry ID Field</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLLB</name>
                            <description>Global Acceptance Filter List Entry Loopback Configuration</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Global Acceptance Filter List entry ID for acceptance filtering with attribute RX</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Global Acceptance Filter List entry ID for acceptance filtering with attribute TX</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GAFLRTR</name>
                            <description>Global Acceptance Filter List Entry RTR Field</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GAFLIDE</name>
                            <description>Global Acceptance Filter List Entry IDE Field</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Standard identifier of rule entry ID is valid for acceptance filtering</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Extended identifier of rule entry ID is valid for acceptance filtering</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>1-16</dimIndex>
                    <name>CFDGAFLM%s</name>
                    <description>Global Acceptance Filter List Mask Registers</description>
                    <addressOffset>0x1804</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAFLIDM</name>
                            <description>Global Acceptance Filter List ID Mask Field</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLIFL1</name>
                            <description>Global Acceptance Filter List Information Label 1</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLRTRM</name>
                            <description>Global Acceptance Filter List Entry RTR Mask</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RTR bit is not used for ID matching</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RTR bit is used for ID matching</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GAFLIDEM</name>
                            <description>Global Acceptance Filter List IDE Mask</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>IDE bit is not used for ID matching</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>IDE bit is used for ID matching</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>1-16</dimIndex>
                    <name>CFDGAFLP0%s</name>
                    <description>Global Acceptance Filter List Pointer 0 Registers</description>
                    <addressOffset>0x1808</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAFLDLC</name>
                            <description>Global Acceptance Filter List DLC Field</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLSRD0</name>
                            <description>Global Acceptance Filter List Select Routing Destination 0</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Routing target is CFIFO0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Routing target is TX Queue 0 instead of CFIFO0</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GAFLSRD1</name>
                            <description>Global Acceptance Filter List Select Routing Destination 1</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Routing target is CFIFO1</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Routing target is TX Queue 1 instead of CFIFO1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GAFLSRD2</name>
                            <description>Global Acceptance Filter List Select Routing Destination 2</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Routing target is CFIFO2</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Routing target is TX Queue 2 instead of CFIFO2</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GAFLIFL0</name>
                            <description>Global Acceptance Filter List Information Label 0</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLRMDP</name>
                            <description>Global Acceptance Filter List RX Message Buffer Direction Pointer</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLRMV</name>
                            <description>Global Acceptance Filter List RX Message Buffer Valid</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Single message buffer direction pointer is invalid</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Single message buffer direction pointer is valid</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GAFLPTR</name>
                            <description>Global Acceptance Filter List Pointer</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>1-16</dimIndex>
                    <name>CFDGAFLP1%s</name>
                    <description>Global Acceptance Filter List Pointer 1 Registers</description>
                    <addressOffset>0x180C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GAFLFDP</name>
                            <description>Global Acceptance Filter List FIFO Direction Pointer</description>
                            <lsb>0</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMID%s_0</name>
                    <description>RX Message Buffer ID Register %s Channel 0</description>
                    <addressOffset>0x2000</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMID</name>
                            <description>RX Message Buffer ID Field</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMRTR</name>
                            <description>RX Message Buffer RTR Bit</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMIDE</name>
                            <description>RX Message Buffer IDE Bit</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>STD-ID is stored</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>EXT-ID is stored</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMPTR%s_0</name>
                    <description>RX Message Buffer Pointer Register %s Channel 0</description>
                    <addressOffset>0x2004</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMTS</name>
                            <description>RX Message Buffer Timestamp Field</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDLC</name>
                            <description>RX Message Buffer DLC Field</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
