arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF0_%s_1</name>
                    <description>RX Message Buffer Data Field 0 Register %s Channel 1</description>
                    <addressOffset>0x280C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 1</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 2</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 3</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF1_%s_1</name>
                    <description>RX Message Buffer Data Field 1 Register %s Channel 1</description>
                    <addressOffset>0x2810</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 4</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 5</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 6</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 7</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF2_%s_1</name>
                    <description>RX Message Buffer Data Field 2 Register %s Channel 1</description>
                    <addressOffset>0x2814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 9</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 10</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 11</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF3_%s_1</name>
                    <description>RX Message Buffer Data Field 3 Register %s Channel 1</description>
                    <addressOffset>0x2818</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 13</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 14</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 15</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF4_%s_1</name>
                    <description>RX Message Buffer Data Field 4 Register %s Channel 1</description>
                    <addressOffset>0x281C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 16</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 17</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 18</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 19</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF5_%s_1</name>
                    <description>RX Message Buffer Data Field 5 Register %s Channel 1</description>
                    <addressOffset>0x2820</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 20</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 21</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 22</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 23</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF6_%s_1</name>
                    <description>RX Message Buffer Data Field 6 Register %s Channel 1</description>
                    <addressOffset>0x2824</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 24</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 25</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 26</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 27</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF7_%s_1</name>
                    <description>RX Message Buffer Data Field 7 Register %s Channel 1</description>
                    <addressOffset>0x2828</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 27</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 28</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 29</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 30</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF8_%s_1</name>
                    <description>RX Message Buffer Data Field 8 Register %s Channel 1</description>
                    <addressOffset>0x282C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte (p * 4)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte ((p * 4) + 1)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte ((p * 4) + 2)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte ((p * 4) + 3)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF9_%s_1</name>
                    <description>RX Message Buffer Data Field 9 Register %s Channel 1</description>
                    <addressOffset>0x2830</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 36</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 37</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 38</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 39</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF10_%s_1</name>
                    <description>RX Message Buffer Data Field 10 Register %s Channel 1</description>
                    <addressOffset>0x2834</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RMDB_LL</name>
                            <description>RX Message Buffer Data Byte 40</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_LH</name>
                            <description>RX Message Buffer Data Byte 41</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HL</name>
                            <description>RX Message Buffer Data Byte 42</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB_HH</name>
                            <description>RX Message Buffer Data Byte 43</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
