arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF2%s</name>
                    <description>RX FIFO Access Data Field 2 Register %s</description>
                    <addressOffset>0x6014</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 9</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 10</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 11</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF3%s</name>
                    <description>RX FIFO Access Data Field 3 Register %s</description>
                    <addressOffset>0x6018</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 13</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 14</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 15</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF4%s</name>
                    <description>RX FIFO Access Data Field 4 Register %s</description>
                    <addressOffset>0x601C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 16</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 17</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 18</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 19</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF5%s</name>
                    <description>RX FIFO Access Data Field 5 Register %s</description>
                    <addressOffset>0x6020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 20</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 21</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 22</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 23</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF6%s</name>
                    <description>RX FIFO Access Data Field 6 Register %s</description>
                    <addressOffset>0x6024</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 24</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 25</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 26</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 27</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF7%s</name>
                    <description>RX FIFO Access Data Field 7 Register %s</description>
                    <addressOffset>0x6028</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 28</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 29</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 30</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 31</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF8%s</name>
                    <description>RX FIFO Access Data Field 8 Register %s</description>
                    <addressOffset>0x602C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 32</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 33</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 34</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 35</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF9%s</name>
                    <description>RX FIFO Access Data Field 9 Register %s</description>
                    <addressOffset>0x6030</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 36</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 37</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 38</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 39</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF10%s</name>
                    <description>RX FIFO Access Data Field 10 Register %s</description>
                    <addressOffset>0x6034</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 40</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 41</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 42</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 43</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF11%s</name>
                    <description>RX FIFO Access Data Field 11 Register %s</description>
                    <addressOffset>0x6038</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 44</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 45</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 46</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 47</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF12%s</name>
                    <description>RX FIFO Access Data Field 12 Register %s</description>
                    <addressOffset>0x603C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 48</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 49</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 50</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 51</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF13%s</name>
                    <description>RX FIFO Access Data Field 13 Register %s</description>
                    <addressOffset>0x6040</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 52</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 53</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 54</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 55</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
