arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF14%s</name>
                    <description>RX FIFO Access Data Field 14 Register %s</description>
                    <addressOffset>0x6044</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 56</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 57</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 58</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 59</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDRFDF15%s</name>
                    <description>RX FIFO Access Data Field 15 Register %s</description>
                    <addressOffset>0x6048</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RFDB_LL</name>
                            <description>RX FIFO Buffer Data Byte 60</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_LH</name>
                            <description>RX FIFO Buffer Data Byte 61</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HL</name>
                            <description>RX FIFO Buffer Data Byte 62</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RFDB_HH</name>
                            <description>RX FIFO Buffer Data Byte 63</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFID%s_0</name>
                    <description>Common FIFO Access ID Register %s Channel 0</description>
                    <addressOffset>0x6400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFID</name>
                            <description>Common FIFO Buffer ID Field</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THLEN</name>
                            <description>THL Entry Enable</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Entry is not to be stored in THL after successful TX</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Entry is to be stored in THL after successful TX</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFRTR</name>
                            <description>Common FIFO Buffer RTR bit</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFIDE</name>
                            <description>Common FIFO Buffer IDE bit</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>STD-ID is to be transmitted or has been received</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>EXT-ID is to be transmitted or has been received</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFPTR%s_0</name>
                    <description>Common FIFO Access Pointer Register %s Channel 0</description>
                    <addressOffset>0x6404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFTS</name>
                            <description>Common FIFO Timestamp Value</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDLC</name>
                            <description>Common FIFO Buffer DLC Field</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFFDCSTS%s_0</name>
                    <description>Common FIFO Access CAN-FD Control/Status Register %s Channel 0</description>
                    <addressOffset>0x6408</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFESI</name>
                            <description>Error State Indicator bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CAN-FD frame received or to transmit by error active node</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CAN-FD frame received or to transmit by error passive node</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFBRS</name>
                            <description>Bit Rate Switch bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CAN-FD frame received or to transmit with no bit rate switch</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CAN-FD frame received or to transmit with bit rate switch</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFFDF</name>
                            <description>CAN FD Format bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non CAN-FD frame received or to transmit</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CAN-FD frame received or to transmit</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFIFL</name>
                            <description>COMMON FIFO Buffer Information Label Field</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFPTR</name>
                            <description>Common FIFO Buffer Pointer Field</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF0%s_0</name>
                    <description>Common FIFO Access Data Field 0 Register %s Channel 0</description>
                    <addressOffset>0x640C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 1</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 2</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 3</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF1%s_0</name>
                    <description>Common FIFO Access Data Field 1 Register %s Channel 0</description>
                    <addressOffset>0x6410</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 4</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 5</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 6</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 7</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF2%s_0</name>
                    <description>Common FIFO Access Data Field 2 Register %s Channel 0</description>
                    <addressOffset>0x6414</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 9</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 10</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 11</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF3%s_0</name>
                    <description>Common FIFO Access Data Field 3 Register %s Channel 0</description>
                    <addressOffset>0x6418</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 13</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 14</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 15</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF4%s_0</name>
                    <description>Common FIFO Access Data Field 4 Register %s Channel 0</description>
                    <addressOffset>0x641C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 16</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 17</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 18</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 19</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
