arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF5%s_0</name>
                    <description>Common FIFO Access Data Field 5 Register %s Channel 0</description>
                    <addressOffset>0x6420</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 20</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 21</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 22</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 23</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF6%s_0</name>
                    <description>Common FIFO Access Data Field 6 Register %s Channel 0</description>
                    <addressOffset>0x6424</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 24</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 25</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 26</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 27</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF7%s_0</name>
                    <description>Common FIFO Access Data Field 7 Register %s Channel 0</description>
                    <addressOffset>0x6428</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 28</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 29</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 30</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 31</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF8%s_0</name>
                    <description>Common FIFO Access Data Field 8 Register %s Channel 0</description>
                    <addressOffset>0x642C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 32</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 33</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 34</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 35</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF9%s_0</name>
                    <description>Common FIFO Access Data Field 9 Register %s Channel 0</description>
                    <addressOffset>0x6430</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 36</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 37</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 38</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 39</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF10%s_0</name>
                    <description>Common FIFO Access Data Field 10 Register %s Channel 0</description>
                    <addressOffset>0x6434</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 40</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 41</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 42</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 43</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF11%s_0</name>
                    <description>Common FIFO Access Data Field 11 Register %s Channel 0</description>
                    <addressOffset>0x6438</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 44</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 45</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 46</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 47</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF12%s_0</name>
                    <description>Common FIFO Access Data Field 12 Register %s Channel 0</description>
                    <addressOffset>0x643C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 48</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 49</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 50</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 51</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF13%s_0</name>
                    <description>Common FIFO Access Data Field 13 Register %s Channel 0</description>
                    <addressOffset>0x6440</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 52</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 53</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 54</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 55</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF14%s_0</name>
                    <description>Common FIFO Access Data Field 14 Register %s Channel 0</description>
                    <addressOffset>0x6444</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 56</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 57</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 58</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 59</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF15%s_0</name>
                    <description>Common FIFO Access Data Field 15 Register %s Channel 0</description>
                    <addressOffset>0x6448</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 60</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 61</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 62</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 63</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
