arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF7%s_1</name>
                    <description>Common FIFO Access Data Field 7 Register %s Channel 1</description>
                    <addressOffset>0x65A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 28</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 29</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 30</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 31</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF8%s_1</name>
                    <description>Common FIFO Access Data Field 8 Register %s Channel 1</description>
                    <addressOffset>0x65AC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 32</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 33</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 34</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 35</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF9%s_1</name>
                    <description>Common FIFO Access Data Field 9 Register %s Channel 1</description>
                    <addressOffset>0x65B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 36</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 37</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 38</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 39</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF10%s_1</name>
                    <description>Common FIFO Access Data Field 10 Register %s Channel 1</description>
                    <addressOffset>0x65B4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 40</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 41</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 42</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 43</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF11%s_1</name>
                    <description>Common FIFO Access Data Field 11 Register %s Channel 1</description>
                    <addressOffset>0x65B8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 44</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 45</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 46</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 47</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF12%s_1</name>
                    <description>Common FIFO Access Data Field 12 Register %s Channel 1</description>
                    <addressOffset>0x65BC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 48</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 49</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 50</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 51</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF13%s_1</name>
                    <description>Common FIFO Access Data Field 13 Register %s Channel 1</description>
                    <addressOffset>0x65C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 52</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 53</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 54</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 55</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF14%s_1</name>
                    <description>Common FIFO Access Data Field 14 Register %s Channel 1</description>
                    <addressOffset>0x65C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 56</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 57</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 58</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 59</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>CFDCFDF15%s_1</name>
                    <description>Common FIFO Access Data Field 15 Register %s Channel 1</description>
                    <addressOffset>0x65C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CFDB_LL</name>
                            <description>Common FIFO Buffer Data Bytes 60</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_LH</name>
                            <description>Common FIFO Buffer Data Bytes 61</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HL</name>
                            <description>Common FIFO Buffer Data Bytes 62</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFDB_HH</name>
                            <description>Common FIFO Buffer Data Bytes 63</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x08</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDTHLACC0%s</name>
                    <description>TX History List Access Registers 0</description>
                    <addressOffset>0x8000</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>BT</name>
                            <description>Buffer Type</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>Flat TX message buffer</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>TX FIFO message buffer number and gateway FIFO message number</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>TX Queue message buffer number</description>
                                    <value>#100</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BN</name>
                            <description>Buffer Number</description>
                            <lsb>3</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TGW</name>
                            <description>Transmit Gateway Buffer Indication</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No transmission from gateway</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transmission from gateway</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TMTS</name>
                            <description>Transmit Timestamp</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x08</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>CFDTHLACC1%s</name>
                    <description>TX History List Access Registers 1</description>
                    <addressOffset>0x8004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TID</name>
                            <description>Transmit ID</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TIFL</name>
                            <description>Transmit Information Label</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>64</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <dimIndex>0-63</dimIndex>
                    <name>CFDRPGACC%s</name>
                    <description>RAM Test Page Access Registers %s</description>
                    <addressOffset>0x8400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RDTA</name>
                            <description>RAM Data Test Access</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
