arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF0_%s_1</name>
                    <description>TX Message Buffer Data Field 0 Register %s Channel 1</description>
                    <addressOffset>0x1200C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 1</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 2</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 3</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF1_%s_1</name>
                    <description>TX Message Buffer Data Field 1 Register %s Channel 1</description>
                    <addressOffset>0x12010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 4</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 5</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 6</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 7</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF2_%s_1</name>
                    <description>TX Message Buffer Data Field 2 Register %s Channel 1</description>
                    <addressOffset>0x12014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 9</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 10</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 11</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF3_%s_1</name>
                    <description>TX Message Buffer Data Field 3 Register %s Channel 1</description>
                    <addressOffset>0x12018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 12</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 12</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 12</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF4_%s_1</name>
                    <description>TX Message Buffer Data Field 4 Register %s Channel 1</description>
                    <addressOffset>0x1201C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 16</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 17</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 18</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 19</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF5_%s_1</name>
                    <description>TX Message Buffer Data Field 5 Register %s Channel 1</description>
                    <addressOffset>0x12020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 20</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 21</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 22</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 23</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF6_%s_1</name>
                    <description>TX Message Buffer Data Field 6 Register %s Channel 1</description>
                    <addressOffset>0x12024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 24</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 25</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 26</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 27</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF7_%s_1</name>
                    <description>TX Message Buffer Data Field 7 Register %s Channel 1</description>
                    <addressOffset>0x12028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 28</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte29</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 30</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 31</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF8_%s_1</name>
                    <description>TX Message Buffer Data Field 8 Register %s Channel 1</description>
                    <addressOffset>0x1202C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 32</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 33</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 34</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 35</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF9_%s_1</name>
                    <description>TX Message Buffer Data Field 9 Register %s Channel 1</description>
                    <addressOffset>0x12030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 36</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 37</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 38</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 39</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CFDTMDF10_%s_1</name>
                    <description>TX Message Buffer Data Field 10 Register %s Channel 1</description>
                    <addressOffset>0x12034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte 40</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte 41</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte 42</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte 43</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
