arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>32-39</dimIndex>
                    <name>CFDTMDF13_%s_1</name>
                    <description>TX Message Buffer Data Field 13 Register %s Channel 1</description>
                    <addressOffset>0x13040</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>32-39</dimIndex>
                    <name>CFDTMDF14_%s_1</name>
                    <description>TX Message Buffer Data Field 14 Register %s Channel 1</description>
                    <addressOffset>0x13044</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x080</dimIncrement>
                    <dimIndex>32-39</dimIndex>
                    <name>CFDTMDF15_%s_1</name>
                    <description>TX Message Buffer Data Field X Register 15 Channel 1</description>
                    <addressOffset>0x13048</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TMDB_LL</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_LH</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HL</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMDB_HH</name>
                            <description>TX Message Buffer Data Byte X</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
