arduino/ArduinoCore-renesas/svd/R7FA6M5BH.svd
                <register>
                    <name>PL1CTRL2</name>
                    <description>Function L1 Control Register 2</description>
                    <addressOffset>0x146</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x1f00</resetMask>
                    <fields>
                        <field>
                            <name>HIRDMON</name>
                            <description>HIRD Value Monitor</description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RWEMON</name>
                            <description>RWE Value Monitor</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HL1CTRL1</name>
                    <description>Host L1 Control Register 1</description>
                    <addressOffset>0x148</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0007</resetMask>
                    <fields>
                        <field>
                            <name>L1REQ</name>
                            <description>L1 Transition Request</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L1STATUS</name>
                            <description>L1 Request Completion Status</description>
                            <lsb>1</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>ACK received</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>NYET received</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>STALL received</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Transaction error</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HL1CTRL2</name>
                    <description>Host L1 Control Register 2</description>
                    <addressOffset>0x14A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x9f0f</resetMask>
                    <fields>
                        <field>
                            <name>L1ADDR</name>
                            <description>LPM Token DeviceAddress</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HIRD</name>
                            <description>LPM Token HIRD</description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L1RWE</name>
                            <description>LPM Token L1 RemoteWake Enable</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BESL</name>
                            <description>BESL &amp; Alternate HIRD</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPUSR0R</name>
                    <description>Deep Software Standby USB Transceiver Control/Pin Monitor Register</description>
                    <addressOffset>0x160</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff4fffff</resetMask>
                    <fields>
                        <field>
                            <name>DOVCAHM</name>
                            <description>OVRCURA Input Flag</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DOVCBHM</name>
                            <description>OVRCURB Input Flag</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DVBSTSHM</name>
                            <description>VBUS Input Flag</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPUSR1R</name>
                    <description>Deep Software Standby USB Suspend/Resume Interrupt Register</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DOVCAHE</name>
                            <description>OVRCURA Interrupt Enable Clear</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable recovery from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable recovery from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVCBHE</name>
                            <description>OVRCURB Interrupt Enable Clear</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable recovery from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable recovery from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DVBSTSHE</name>
                            <description>VBUS Interrupt Enable/Clear</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable recovery from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable recovery from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVCAH</name>
                            <description>OVRCURA Interrupt Source Return Status Flag</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>System has not recovered from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>System recovered from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVCBH</name>
                            <description>OVRCURB Interrupt Source Return Status Flag</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>System has not recovered from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>System recovered from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DVBSTSH</name>
                            <description>VBUS Interrupt Source Return Status Flag</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>System has not recovered from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>System recovered from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPUSR2R</name>
                    <description>Deep Software Standby USB Suspend/Resume Interrupt Register</description>
                    <addressOffset>0x168</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>DPINT</name>
                            <description>Indication of Return from DP Interrupt Source</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>System has not recovered from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>System recovered from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMINT</name>
                            <description>Indication of Return from DM Interrupt Source</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>System has not recovered from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>System recovered from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DPVAL</name>
                            <description>DP Input</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMVAL</name>
                            <description>DM Input</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DPINTE</name>
                            <description>DP Interrupt Enable Clear</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable recovery from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable recovery from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMINTE</name>
                            <description>DM Interrupt Enable Clear</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable recovery from Deep Software Standby mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable recovery from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPUSRCR</name>
                    <description>Deep Software Standby USB Suspend/Resume Command Register</description>
                    <addressOffset>0x16A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>FIXPHY</name>
                            <description>USB Transceiver Control Fix</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Normal mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Invoke/recover from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIXPHYPD</name>
                            <description>USB Transceiver Control Fix for PLL</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Normal mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Invoke/recover from Deep Software Standby mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
